vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>LM3S_DFP</name>
  <description>Texas Instruments LM3S Series Device Support</description>

  <releases>
    <release version="1.1.1" date="2024-02-09" deprecated="2024-02-09">
      This pack is no longer maintained.
      Added debug sequences.
    </release>
    <release version="1.1.0" date="2015-09-30">
      Corrected RAM settings.
    </release>
    <release version="1.0.0">
      First Release version of TI LM3S Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Texas Instruments</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package TI LM3S</keyword>
    <keyword>LM3S</keyword>
  </keywords>

  <devices>
    <family Dfamily="LM3S Series" Dvendor="Texas Instruments:16">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <book name="Documents\dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
TI's LM3S Series is a digital signal controller for embedded applications requiring a high level of integration and low power dissipation.
Typical applications include Point-of-sale terminals, web servers, multi-protocol bridges, Automation controllers, application control, robotics control, Audio, MP3 decoderscar alarms, GPS/fleet monitors

  - LCD Controller (1024x768x24) for STN and TFT
  - CRC Engine
  - Event Recorder
  - Quad SPI Flash interface (SPIFI)
  - Motor control PWM for three-phase motor
  - Unique ID for each device
      </description>

      <feature type="RTC"           n="1"/>
      <feature type="Temp"          n="-40"     m="85"/>

      <sequences>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;

            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>

          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>

          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>

            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
        </sequence>

        <sequence name="DebugDeviceUnlock">
          <block>
            __var val = 0;
            val = Read32(0x400FE040);  // Read SYSCTL_SRCR0
            Write32(0x400FE040, val | 0x00000008);  // Write SYSCTL_SRCR0 to set WDT reset
            Write32(0x400FE040, val);               // Write SYSCTL_SRCR0 to clear WDT reset
          </block>
        </sequence>


        <sequence name="ResetSystem">
          <block>
            __var val = 0;
            __var hwMCU = 0;
            __var NVIC_AIRCR = 0xE000ED0C;
            __var VECTKEY = 0x05FA0000;
            __var VECTRESET = 0x00000001;
            __var SYSRESETREQ = 0x00000004;
            __var EXEC_COND_BLOCK = 1;

            val = Read32(0x400FE040);  // Read SYSCTL_SRCR0
            Write32(0x400FE040, val | 0x00000008);  // Write SYSCTL_SRCR0 to set WDT reset
            Write32(0x400FE040, val);               // Write SYSCTL_SRCR0 to clear WDT reset
              
            hwMCU = (Read32(0x400FE000) &amp; 0x00FFFFFF);
          </block>

          <block>
             Message(0, "Executing ResetHardware V4b");
          </block>

          <control if="((hwMCU == 0x00040203) || (hwMCU == 0x00040204) || (hwMCU == 0x00060001) || (hwMCU == 0x00060002))">
            <block>
              // Power down the USB PLL.
              val = Read32(0x400FE070);  // Read SYSCTL_RCC2
              val = val |  0x00004000;  // Set SYSCTL_RCC2_USBPWRDN
              Write32(0x400FE070,  val);  // Write SYSCTL_RCC2

              // Reset the peripherals that might depend upon the PLL being active.
              val = Read32(0x400FE040);  // Read SYSCTL_SRCR0
              val = val |  0x00030000;  // Set SYSCTL_SRCR0_ADC0 and SYSCTL_SRCR0_ADC1
              Write32(0x400FE040,  val);  // Write SYSCTL_SRCR0
              val = Read32(0x400FE048);  // Read SYSCTL_SRCR2
              val = val |  0x00010000;  // Set SYSCTL_SRCR2_USB0
              Write32(0x400FE048,  val);  // Write SYSCTL_SRCR2

              // Disable the PLL and the system clock divider
              // (this is a NOP if they are already disabled).
              val = Read32(0x400FE060);  // Read SYSCTL_RCC
              val = val &amp; (~0x00400000);  // Clear USESYSDIV
              val = val |  0x00000800;  // Set BYPASS
              Write32(0x400FE060,  val);  // Write SYSCTL_RCC
              val = Read32(0x400FE070);  // Read SYSCTL_RCC2
              val = val |  0x00000800;  // Set BYPASS2
              Write32(0x400FE070,  val);  // Write SYSCTL_RCC2

              // Now, write RCC and RCC2 to their reset values.
              val = Read32(0x400FE060);  // Read SYSCTL_RCC
              Write32(0x400FE060,  0x078E3AD0 | (val &amp; 0x00000001));
              Write32(0x400FE070,  0x07806810);  // Write SYSCTL_RCC2
              Write32(0x400FE060,  0x078E3AD1);  // Write SYSCTL_RCC

              // Reset the deep sleep clock configuration register.
              Write32(0x400FE144,  0x07800000);  // Write SYSCTL_DSLPCLKCFG

              // Reset the clock gating registers.
              Write32(0x400FE100,  0x00000040);  // Write SYSCTL_RCGC0
              Write32(0x400FE104,  0x00000000);  // Write SYSCTL_RCGC1
              Write32(0x400FE108,  0x00000000);  // Write SYSCTL_RCGC2
              Write32(0x400FE110,  0x00000040);  // Write SYSCTL_SCGC0
              Write32(0x400FE114,  0x00000000);  // Write SYSCTL_SCGC1
              Write32(0x400FE118,  0x00000000);  // Write SYSCTL_SCGC2
              Write32(0x400FE120,  0x00000040);  // Write SYSCTL_DCGC0
              Write32(0x400FE124,  0x00000000);  // Write SYSCTL_DCGC1
              Write32(0x400FE128,  0x00000000);  // Write SYSCTL_DCGC2

