vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
              // Reset the remaining SysCtl registers.
              Write32(0x400FE030,  0x00000000);  // Write SYSCTL_PBORCTL
              Write32(0x400FE054,  0x00000000);  // Write SYSCTL_IMC
              Write32(0x400FE06C,  0x00000000);  // Write SYSCTL_GPIOHBCTL
              Write32(0x400FE07C,  0x00000000);  // Write SYSCTL_MOSCCTL
              Write32(0x400FE150,  0x00000000);  // Write SYSCTL_PIOSCCAL
              Write32(0x400FE170,  0x00000000);  // Write SYSCTL_I2SMCLKCFG

               // Reset the peripherals.
              Write32(0x400FE040, 0xFFFFFFFF);  // Write SYSCTL_SRCR0
              Write32(0x400FE044, 0xFFFFFFFF);  // Write SYSCTL_SRCR1
              Write32(0x400FE048, 0xFFFFFFFF);  // Write SYSCTL_SRCR2
              Write32(0x400FE040, 0x00000000);  // Write SYSCTL_SRCR0
              Write32(0x400FE044, 0x00000000);  // Write SYSCTL_SRCR1
              Write32(0x400FE048, 0x00000000);  // Write SYSCTL_SRCR2

              // Clear any pending SysCtl interrupts.
              Write32(0x400FE058, 0xFFFFFFFF);  // Write SYSCTL_MISC
            </block>

            <!-- Wait for any pending flash operations to complete. -->
            <control while="(((Read32(0x400FD008)) &amp; 0xFFFF) != 0)" timeout="100000" info="Wait for FLASH_FMC"/>
            <control while="(((Read32(0x400FD020)) &amp; 0xFFFF) != 0)" timeout="100000" info="Wait for FLASH_FMC2"/>

            <block>
              // Reset the flash controller registers.
              Write32(0x400FD000, 0x00000000);  // Write FLASH_FMA
              Write32(0x400FD010, 0x00000000);  // Write FLASH_FCIM
              Write32(0x400FD014, 0xFFFFFFFF);  // Write FLASH_FCMISC
              Write32(0x400FD030, 0x00000000);  // Write FLASH_FWBVAL

              // VECTRESET resets core (without peripherals)
              Write32(NVIC_AIRCR, VECTKEY | VECTRESET);

              // Map Flash to 0
              Write32(0x400FE0F0, 0x00000001);  // Write SYSCTL_RMCTL

              EXEC_COND_BLOCK = 0;

            </block>
          </control>
          <control if="((hwMCU &lt; 0x00000200) &amp;&amp; (EXEC_COND_BLOCK))">
            <block>
              // Disable the PLL and the system clock divider
              // (this is a NOP if they are already disabled).
              val = Read32(0x400FE060);  // Read SYSCTL_RCC
              val = val &amp; (~0x00400000);  // Clear USESYSDIV
              val = val |  0x00000800;  // Set BYPASS
              Write32(0x400FE060,  val);  // Write SYSCTL_RCC

              // Now, write RCC to its reset value.
              Write32(0x400FE060,  0x078E39C0);  // Write SYSCTL_RCC

              // Reset the remaining SysCtl registers.
              Write32(0x400FE030,  0x00007FFC);  // Write SYSCTL_PBORCTL
              Write32(0x400FE034,  0x00000000);  // Write SYSCTL_LDOPC
              Write32(0x400FE054,  0x00000000);  // Write SYSCTL_IMC

              // Reset the peripherals.
              Write32(0x400FE040, 0xFFFFFFFF);  // Write SYSCTL_SRCR0
              Write32(0x400FE044, 0xFFFFFFFF);  // Write SYSCTL_SRCR1
              Write32(0x400FE048, 0xFFFFFFFF);  // Write SYSCTL_SRCR2
              Write32(0x400FE040, 0x00000000);  // Write SYSCTL_SRCR0
              Write32(0x400FE044, 0x00000000);  // Write SYSCTL_SRCR1
              Write32(0x400FE048, 0x00000000);  // Write SYSCTL_SRCR2

              // VECTRESET resets core (without peripherals)
              Write32(NVIC_AIRCR, VECTKEY | VECTRESET);

              EXEC_COND_BLOCK = 0;

            </block>
          </control>
          <control if="((hwMCU &gt;= 0x00000200) &amp;&amp; (EXEC_COND_BLOCK))">
            <block>
              // Some chips will not reset after Fault (write to disabled peripheral)
              //  when 200MHz PLL is used. Therefore we bypass PLL before Reset
              val = Read32(0x400FE060);  // Read SYSCTL_RCC
              val = val &amp; (~0x00400000);  // Clear USESYSDIV
              val = val |  0x00000800;  // Set BYPASS
              Write32(0x400FE060,  val);  // Write SYSCTL_RCC

              // SYSRESETREQ resets chip (core &amp; peripherals)
              Write32(NVIC_AIRCR, VECTKEY | SYSRESETREQ);
            </block>
          </control>
          <block>
             Message(0, "End of ResetSystem V4b");
          </block>
        </sequence>
      </sequences>

      <!-- ************************  Subfamily 'LM3S1xx'  **************************** -->
      <subFamily DsubFamily="LM3S1xx">
        <feature type="WDT"           n="1"/>
        <feature type="UART"          n="1"       m="10000000"/>
        <feature type="SPI"           n="1"/>
        <feature type="IOs"           n="18"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="QFP"           n="48"/>
      
        <!-- *************************  Device 'LM3S101'  ***************************** -->
        <device Dname="LM3S101">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s101.h" define="LM3S101"/>
          <debug svd="SVD\lm3s101.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_8.FLM"   start="0x00000000" size="0x00002000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S101&amp;fileType=pdf" title="LM3S101 Datasheet"/>
  
          <feature type="Timer"         n="1"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
        </device>
        
        <!-- *************************  Device 'LM3S102'  ***************************** -->
        <device Dname="LM3S102">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s102.h" define="LM3S102"/>
          <debug svd="SVD\lm3s102.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_8.FLM"   start="0x00000000" size="0x00002000"             default="1"/>
  
