vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S102&amp;fileType=pdf" title="LM3S102 Datasheet"/>
  
          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S3xx'  **************************** -->
      <subFamily DsubFamily="LM3S3xx">
        <feature type="WDT"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFP"           n="48"/>
      
        <!-- *************************  Device 'LM3S300'  ***************************** -->
        <device Dname="LM3S300">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s300.h" define="LM3S300"/>
          <debug svd="SVD\lm3s300.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S300&amp;fileType=pdf" title="LM3S300 Datasheet"/>
  
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
        </device>
        
        <!-- *************************  Device 'LM3S301'  ***************************** -->
        <device Dname="LM3S301">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s301.h" define="LM3S301"/>
          <debug svd="SVD\lm3s301.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S301&amp;fileType=pdf" title="LM3S301 Datasheet"/>

          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="33"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
        
        <!-- *************************  Device 'LM3S308'  ***************************** -->
        <device Dname="LM3S308">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s308.h" define="LM3S308"/>
          <debug svd="SVD\lm3s308.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S308&amp;fileType=pdf" title="LM3S308 Datasheet"/>

          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="28"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
        
        <!-- *************************  Device 'LM3S310'  ***************************** -->
        <device Dname="LM3S310">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s310.h" define="LM3S310"/>
          <debug svd="SVD\lm3s310.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S310&amp;fileType=pdf" title="LM3S310 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S315'  ***************************** -->
        <device Dname="LM3S315">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s315.h" define="LM3S315"/>
          <debug svd="SVD\lm3s315.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S315&amp;fileType=pdf" title="LM3S315 Datasheet"/>

