vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
        
        <!-- *************************  Device 'LM3S601'  ***************************** -->
        <device Dname="LM3S601">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s601.h" define="LM3S601"/>
          <debug svd="SVD\lm3s601.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S601&amp;fileType=pdf" title="LM3S601 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S608'  ***************************** -->
        <device Dname="LM3S608">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s608.h" define="LM3S608"/>
          <debug svd="SVD\lm3s608.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S608&amp;fileType=pdf" title="LM3S608 Datasheet"/>

          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S610'  ***************************** -->
        <device Dname="LM3S610">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s610.h" define="LM3S610"/>
          <debug svd="SVD\lm3s610.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S610&amp;fileType=pdf" title="LM3S610 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S611'  ***************************** -->
        <device Dname="LM3S611">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s611.h" define="LM3S611"/>
          <debug svd="SVD\lm3s611.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S611&amp;fileType=pdf" title="LM3S611 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="IOs"           n="32"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S612'  ***************************** -->
        <device Dname="LM3S612">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s612.h" define="LM3S612"/>
          <debug svd="SVD\lm3s612.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S612&amp;fileType=pdf" title="LM3S612 Datasheet"/>

