vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S613'  ***************************** -->
        <device Dname="LM3S613">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s613.h" define="LM3S613"/>
          <debug svd="SVD\lm3s613.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S613&amp;fileType=pdf" title="LM3S613 Datasheet"/>

          <feature type="PWM"           n="4"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="32"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S615'  ***************************** -->
        <device Dname="LM3S615">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s615.h" define="LM3S615"/>
          <debug svd="SVD\lm3s615.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S615&amp;fileType=pdf" title="LM3S615 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S617'  ***************************** -->
        <device Dname="LM3S617">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s617.h" define="LM3S617"/>
          <debug svd="SVD\lm3s617.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S617&amp;fileType=pdf" title="LM3S617 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="30"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S618'  ***************************** -->
        <device Dname="LM3S618">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s618.h" define="LM3S618"/>
          <debug svd="SVD\lm3s618.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S618&amp;fileType=pdf" title="LM3S618 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="30"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S628'  ***************************** -->
        <device Dname="LM3S628">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s628.h" define="LM3S628"/>
          <debug svd="SVD\lm3s628.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

