vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S628&amp;fileType=pdf" title="LM3S628 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFP"           n="48"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S8xx'  **************************** -->
      <subFamily DsubFamily="LM3S8xx">
        <feature type="WDT"           n="1"/>
        <feature type="UART"          n="2"       m="10000000"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFP"           n="48"/>
      
        <!-- *************************  Device 'LM3S800'  ***************************** -->
        <device Dname="LM3S800">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s800.h" define="LM3S800"/>
          <debug svd="SVD\lm3s800.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
  
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S800&amp;fileType=pdf" title="LM3S800 Datasheet"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
        
        <!-- *************************  Device 'LM3S801'  ***************************** -->
        <device Dname="LM3S801">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s801.h" define="LM3S801"/>
          <debug svd="SVD\lm3s801.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S801&amp;fileType=pdf" title="LM3S801 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
          <feature type="Temp"          n="-40"     m="105"/>
        </device>
        
        <!-- *************************  Device 'LM3S808'  ***************************** -->
        <device Dname="LM3S808">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s808.h" define="LM3S808"/>
          <debug svd="SVD\lm3s808.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S808&amp;fileType=pdf" title="LM3S808 Datasheet"/>

          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="28"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S811'  ***************************** -->
        <device Dname="LM3S811">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s811.h" define="LM3S811"/>
          <debug svd="SVD\lm3s811.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S811&amp;fileType=pdf" title="LM3S811 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="32"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S812'  ***************************** -->
        <device Dname="LM3S812">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s812.h" define="LM3S812"/>
          <debug svd="SVD\lm3s812.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S812&amp;fileType=pdf" title="LM3S812 Datasheet"/>

