vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S815'  ***************************** -->
        <device Dname="LM3S815">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s815.h" define="LM3S815"/>
          <debug svd="SVD\lm3s815.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S815&amp;fileType=pdf" title="LM3S815 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S817'  ***************************** -->
        <device Dname="LM3S817">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s817.h" define="LM3S817"/>
          <debug svd="SVD\lm3s817.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S817&amp;fileType=pdf" title="LM3S817 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="30"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S818'  ***************************** -->
        <device Dname="LM3S818">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s818.h" define="LM3S818"/>
          <debug svd="SVD\lm3s818.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S818&amp;fileType=pdf" title="LM3S818 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="30"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>
        
        <!-- *************************  Device 'LM3S828'  ***************************** -->
        <device Dname="LM3S828">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s828.h" define="LM3S828"/>
          <debug svd="SVD\lm3s828.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S828&amp;fileType=pdf" title="LM3S828 Datasheet"/>

