vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1776&amp;fileType=pdf" title="LM3S1776 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="3"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S1811'  ***************************** -->
        <device Dname="LM3S1811">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1811.h" define="LM3S1811"/>
          <debug svd="SVD\lm3s1811.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1811&amp;fileType=pdf" title="LM3S1811 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="67"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S1816'  ***************************** -->
        <device Dname="LM3S1816">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1816.h" define="LM3S1816"/>
          <debug svd="SVD\lm3s1816.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1816&amp;fileType=pdf" title="LM3S1816 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S1850'  ***************************** -->
        <device Dname="LM3S1850">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1850.h" define="LM3S1850"/>
          <debug svd="SVD\lm3s1850.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1850&amp;fileType=pdf" title="LM3S1850 Datasheet"/>

