vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
        <!-- *************************  Device 'LM3S1H11'  ***************************** -->
        <device Dname="LM3S1H11">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s1h11.h" define="LM3S1H11"/>
          <debug svd="SVD\lm3s1h11.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1H11&amp;fileType=pdf" title="LM3S1H11 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="67"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S1H16'  ***************************** -->
        <device Dname="LM3S1H16">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s1h16.h" define="LM3S1H16"/>
          <debug svd="SVD\lm3s1h16.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1H16&amp;fileType=pdf" title="LM3S1H16 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S1J11'  ***************************** -->
        <device Dname="LM3S1J11">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1j11.h" define="LM3S1J11"/>
          <debug svd="SVD\lm3s1j11.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1J11&amp;fileType=pdf" title="LM3S1J11 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="67"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S1J16'  ***************************** -->
        <device Dname="LM3S1J16">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1j16.h" define="LM3S1J16"/>
          <debug svd="SVD\lm3s1j16.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1J16&amp;fileType=pdf" title="LM3S1J16 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S1N11'  ***************************** -->
        <device Dname="LM3S1N11">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1n11.h" define="LM3S1N11"/>
          <debug svd="SVD\lm3s1n11.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1N11&amp;fileType=pdf" title="LM3S1N11 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="67"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
