vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
        <!-- *************************  Device 'LM3S1W16'  ***************************** -->
        <device Dname="LM3S1W16">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1w16.h" define="LM3S1W16"/>
          <debug svd="SVD\lm3s1w16.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1W16&amp;fileType=pdf" title="LM3S1W16 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S1Z16'  ***************************** -->
        <device Dname="LM3S1Z16">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s1z16.h" define="LM3S1Z16"/>
          <debug svd="SVD\lm3s1z16.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S1Z16&amp;fileType=pdf" title="LM3S1Z16 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S2xxx'  **************************** -->
      <subFamily DsubFamily="LM3S2xxx">
      
        <!-- *************************  Device 'LM3S2110'  ***************************** -->
        <device Dname="LM3S2110">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s2110.h" define="LM3S2110"/>
          <debug svd="SVD\lm3s2110.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2110&amp;fileType=pdf" title="LM3S2110 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="40"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2139'  ***************************** -->
        <device Dname="LM3S2139">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s2139.h" define="LM3S2139"/>
          <debug svd="SVD\lm3s2139.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2139&amp;fileType=pdf" title="LM3S2139 Datasheet"/>

