vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="56"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2276'  ***************************** -->
        <device Dname="LM3S2276">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2276.h" define="LM3S2276"/>
          <debug svd="SVD\lm3s2276.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2276&amp;fileType=pdf" title="LM3S2276 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="3"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="1"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S2410'  ***************************** -->
        <device Dname="LM3S2410">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s2410.h" define="LM3S2410"/>
          <debug svd="SVD\lm3s2410.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2410&amp;fileType=pdf" title="LM3S2410 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="60"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2412'  ***************************** -->
        <device Dname="LM3S2412">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s2412.h" define="LM3S2412"/>
          <debug svd="SVD\lm3s2412.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2412&amp;fileType=pdf" title="LM3S2412 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="49"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2432'  ***************************** -->
        <device Dname="LM3S2432">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2432.h" define="LM3S2432"/>
          <debug svd="SVD\lm3s2432.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2432&amp;fileType=pdf" title="LM3S2432 Datasheet"/>

