vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2533'  ***************************** -->
        <device Dname="LM3S2533">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2533.h" define="LM3S2533"/>
          <debug svd="SVD\lm3s2533.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2533&amp;fileType=pdf" title="LM3S2533 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="48"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2601'  ***************************** -->
        <device Dname="LM3S2601">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2601.h" define="LM3S2601"/>
          <debug svd="SVD\lm3s2601.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2601&amp;fileType=pdf" title="LM3S2601 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="60"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2608'  ***************************** -->
        <device Dname="LM3S2608">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2608.h" define="LM3S2608"/>
          <debug svd="SVD\lm3s2608.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2608&amp;fileType=pdf" title="LM3S2608 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="52"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S2616'  ***************************** -->
        <device Dname="LM3S2616">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s2616.h" define="LM3S2616"/>
          <debug svd="SVD\lm3s2616.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2616&amp;fileType=pdf" title="LM3S2616 Datasheet"/>

          <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
          <feature type="DMA"           n="1"/>
          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S2620'  ***************************** -->
        <device Dname="LM3S2620">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s2620.h" define="LM3S2620"/>
          <debug svd="SVD\lm3s2620.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S2620&amp;fileType=pdf" title="LM3S2620 Datasheet"/>

