vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="WDT"           n="1"/>
          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="7"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="USBH"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="61"/>
          <feature type="QFP"           n="100"/>
        </device>
        
        <!-- *************************  Device 'LM3S3826'  ***************************** -->
        <device Dname="LM3S3826">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s3826.h" define="LM3S3826"/>
          <debug svd="SVD\lm3s3826.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S3826&amp;fileType=pdf" title="LM3S3826 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="USBD"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S3J26'  ***************************** -->
        <device Dname="LM3S3J26">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s3j26.h" define="LM3S3J26"/>
          <debug svd="SVD\lm3s3j26.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S3J26&amp;fileType=pdf" title="LM3S3J26 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="USBD"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S3N26'  ***************************** -->
        <device Dname="LM3S3N26">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s3n26.h" define="LM3S3N26"/>
          <debug svd="SVD\lm3s3n26.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S3N26&amp;fileType=pdf" title="LM3S3N26 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="USBD"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="QFP"           n="64"/>
        </device>
        
