vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
        <!-- *************************  Device 'LM3S3W26'  ***************************** -->
        <device Dname="LM3S3W26">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s3w26.h" define="LM3S3W26"/>
          <debug svd="SVD\lm3s3w26.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S3W26&amp;fileType=pdf" title="LM3S3W26 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="USBD"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S3Z26'  ***************************** -->
        <device Dname="LM3S3Z26">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s3z26.h" define="LM3S3Z26"/>
          <debug svd="SVD\lm3s3z26.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S3Z26&amp;fileType=pdf" title="LM3S3Z26 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="USBD"          n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="ComOther"      n="8"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S5xxx'  **************************** -->
      <subFamily DsubFamily="LM3S5xxx">
        <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
        <feature type="DMA"           n="1"/>
        <feature type="TempSens"      n="1"/>
      
        <!-- *************************  Device 'LM3S5632'  ***************************** -->
        <device Dname="LM3S5632">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s5632.h" define="LM3S5632"/>
          <debug svd="SVD\lm3s5632.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S5632&amp;fileType=pdf" title="LM3S5632 Datasheet"/>

          <feature type="WDT"           n="1"/>
          <feature type="Timer"         n="5"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBH"          n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="6"       m="10"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
        <!-- *************************  Device 'LM3S5651'  ***************************** -->
        <device Dname="LM3S5651">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s5651.h" define="LM3S5651"/>
          <debug svd="SVD\lm3s5651.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S5651&amp;fileType=pdf" title="LM3S5651 Datasheet"/>

