vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="CAN"           n="2"/>
          <feature type="USBOTG"        n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2S"           n="1"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="16"                          name="Analog Comparator"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="72"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S5951'  ***************************** -->
        <device Dname="LM3S5951">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s5951.h" define="LM3S5951"/>
          <debug svd="SVD\lm3s5951.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S5951&amp;fileType=pdf" title="LM3S5951 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="CAN"           n="2"/>
          <feature type="USBOTG"        n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2S"           n="1"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="16"                          name="Analog Comparator"/>
          <feature type="ComOther"      n="2"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="67"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S5956'  ***************************** -->
        <device Dname="LM3S5956">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s5956.h" define="LM3S5956"/>
          <debug svd="SVD\lm3s5956.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S5956&amp;fileType=pdf" title="LM3S5956 Datasheet"/>

          <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
          <feature type="IntRC"         n="1"/>
          <feature type="WDT"           n="2"/>
          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBOTG"        n="1"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
          <feature type="AnalogOther"   n="16"                          name="Analog Comparator"/>
          <feature type="ComOther"      n="2"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="33"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="64"/>
        </device>
        
