vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
      <!-- ************************  Subfamily 'LM3S6xxx'  **************************** -->
      <subFamily DsubFamily="LM3S6xxx">
        <feature type="WDT"           n="1"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="108"/>
      
        <!-- *************************  Device 'LM3S6100'  ***************************** -->
        <device Dname="LM3S6100">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s6100.h" define="LM3S6100"/>
          <debug svd="SVD\lm3s6100.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6100&amp;fileType=pdf" title="LM3S6100 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="30"/>
        </device>
        
        <!-- *************************  Device 'LM3S6110'  ***************************** -->
        <device Dname="LM3S6110">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s6110.h" define="LM3S6110"/>
          <debug svd="SVD\lm3s6110.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6110&amp;fileType=pdf" title="LM3S6110 Datasheet"/>

          <feature type="PWM"           n="2"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="35"/>
        </device>
        
        <!-- *************************  Device 'LM3S6420'  ***************************** -->
        <device Dname="LM3S6420">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s6420.h" define="LM3S6420"/>
          <debug svd="SVD\lm3s6420.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6420&amp;fileType=pdf" title="LM3S6420 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="46"/>
        </device>
        
        <!-- *************************  Device 'LM3S6422'  ***************************** -->
        <device Dname="LM3S6422">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s6422.h" define="LM3S6422"/>
          <debug svd="SVD\lm3s6422.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6422&amp;fileType=pdf" title="LM3S6422 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="2"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="34"/>
        </device>
        
        <!-- *************************  Device 'LM3S6432'  ***************************** -->
        <device Dname="LM3S6432">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6432.h" define="LM3S6432"/>
          <debug svd="SVD\lm3s6432.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6432&amp;fileType=pdf" title="LM3S6432 Datasheet"/>

