vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="38"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S6633'  ***************************** -->
        <device Dname="LM3S6633">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6633.h" define="LM3S6633"/>
          <debug svd="SVD\lm3s6633.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6633&amp;fileType=pdf" title="LM3S6633 Datasheet"/>

          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="41"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S6637'  ***************************** -->
        <device Dname="LM3S6637">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6637.h" define="LM3S6637"/>
          <debug svd="SVD\lm3s6637.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6637&amp;fileType=pdf" title="LM3S6637 Datasheet"/>

          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="41"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S6730'  ***************************** -->
        <device Dname="LM3S6730">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6730.h" define="LM3S6730"/>
          <debug svd="SVD\lm3s6730.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6730&amp;fileType=pdf" title="LM3S6730 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="46"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S6753'  ***************************** -->
        <device Dname="LM3S6753">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6753.h" define="LM3S6753"/>
          <debug svd="SVD\lm3s6753.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6753&amp;fileType=pdf" title="LM3S6753 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="41"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
