vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="PWM"           n="4"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="3"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="43"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S6965'  ***************************** -->
        <device Dname="LM3S6965">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s6965.h" define="LM3S6965"/>
          <debug svd="SVD\lm3s6965.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x0000B800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S6965&amp;fileType=pdf" title="LM3S6965 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="UART"          n="3"       m="10000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="4"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
          <feature type="IOs"           n="42"/>
          <feature type="Other"         n="1"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S8xxx'  **************************** -->
      <subFamily DsubFamily="LM3S8xxx">
        <feature type="WDT"           n="1"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="108"/>
      
        <!-- *************************  Device 'LM3S8530'  ***************************** -->
        <device Dname="LM3S8530">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s8530.h" define="LM3S8530"/>
          <debug svd="SVD\lm3s8530.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S8530&amp;fileType=pdf" title="LM3S8530 Datasheet"/>

          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="CAN"           n="3"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="35"/>
        </device>
        
        <!-- *************************  Device 'LM3S8538'  ***************************** -->
        <device Dname="LM3S8538">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s8538.h" define="LM3S8538"/>
          <debug svd="SVD\lm3s8538.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00018000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S8538&amp;fileType=pdf" title="LM3S8538 Datasheet"/>

          <feature type="Timer"         n="4"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
        </device>
        
