vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S8970&amp;fileType=pdf" title="LM3S8970 Datasheet"/>

          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="3"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="SPI"           n="2"/>
          <feature type="IOs"           n="46"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
        
        <!-- *************************  Device 'LM3S8971'  ***************************** -->
        <device Dname="LM3S8971">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\lm3s8971.h" define="LM3S8971"/>
          <debug svd="SVD\lm3s8971.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S8971&amp;fileType=pdf" title="LM3S8971 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="1"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="Other"         n="1"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="CAN"           n="1"/>
          <feature type="UART"          n="1"       m="10000000"/>
          <feature type="SPI"           n="1"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TempSens"      n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
          <feature type="IOs"           n="38"/>
          <feature type="Other"         n="1"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="108"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S9xxx'  **************************** -->
      <subFamily DsubFamily="LM3S9xxx">
        <feature type="Other"         n="1"                           name="ROM Software Libraries"/>
        <feature type="DMA"           n="1"/>
        <feature type="Other"         n="1"                           name="RTOS pre-certified to IEC 61508-3 SIL"/>
        <feature type="IntRC"         n="1"/>
        <feature type="WDT"           n="2"/>
        <feature type="Timer"         n="8"       m="32"              name="Capture / Compare / PWM (CCP)"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="UART"          n="3"       m="10000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="SPI"           n="2"/>
        <feature type="I2S"           n="1"/>
        <feature type="AnalogOther"   n="1"                           name="External Voltage Reference"/>
        <feature type="TempSens"      n="1"/>
        <feature type="AnalogOther"   n="16"                          name="Analog Comparator"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="108"/>
      
        <!-- *************************  Device 'LM3S9781'  ***************************** -->
        <device Dname="LM3S9781">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9781.h" define="LM3S9781"/>
          <debug svd="SVD\lm3s9781.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9781&amp;fileType=pdf" title="LM3S9781 Datasheet"/>

          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="CAN"           n="3"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="65"/>
        </device>
        
        <!-- *************************  Device 'LM3S9790'  ***************************** -->
        <device Dname="LM3S9790">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9790.h" define="LM3S9790"/>
          <debug svd="SVD\lm3s9790.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9790&amp;fileType=pdf" title="LM3S9790 Datasheet"/>

