vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="CAN"           n="3"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="65"/>
        </device>
        
        <!-- *************************  Device 'LM3S9B90'  ***************************** -->
        <device Dname="LM3S9B90">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9b90.h" define="LM3S9B90"/>
          <debug svd="SVD\lm3s9b90.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9B90&amp;fileType=pdf" title="LM3S9B90 Datasheet"/>

          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="60"/>
          <feature type="Other"         n="1"/>
        </device>
        
        <!-- *************************  Device 'LM3S9B92'  ***************************** -->
        <device Dname="LM3S9B92">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9b92.h" define="LM3S9B92"/>
          <debug svd="SVD\lm3s9b92.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9B92&amp;fileType=pdf" title="LM3S9B92 Datasheet"/>

          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="65"/>
        </device>
        
        <!-- *************************  Device 'LM3S9B95'  ***************************** -->
        <device Dname="LM3S9B95">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9b95.h" define="LM3S9B95"/>
          <debug svd="SVD\lm3s9b95.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9B95&amp;fileType=pdf" title="LM3S9B95 Datasheet"/>

          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="65"/>
        </device>
        
        <!-- *************************  Device 'LM3S9B96'  ***************************** -->
        <device Dname="LM3S9B96">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9b96.h" define="LM3S9B96"/>
          <debug svd="SVD\lm3s9b96.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9B96&amp;fileType=pdf" title="LM3S9B96 Datasheet"/>

          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="65"/>
        </device>
        
        <!-- *************************  Device 'LM3S9BN2'  ***************************** -->
        <device Dname="LM3S9BN2">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9bn2.h" define="LM3S9BN2"/>
          <debug svd="SVD\lm3s9bn2.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9BN2&amp;fileType=pdf" title="LM3S9BN2 Datasheet"/>

