vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.LM3S_DFP.pdsc
          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="72"/>
        </device>
        
        <!-- *************************  Device 'LM3S9G97'  ***************************** -->
        <device Dname="LM3S9G97">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9g97.h" define="LM3S9G97"/>
          <debug svd="SVD\lm3s9g97.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_384.FLM" start="0x00000000" size="0x00060000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9G97&amp;fileType=pdf" title="LM3S9G97 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="ComOther"      n="2"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="60"/>
          <feature type="Other"         n="1"/>
        </device>
        
        <!-- *************************  Device 'LM3S9GN5'  ***************************** -->
        <device Dname="LM3S9GN5">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9gn5.h" define="LM3S9GN5"/>
          <debug svd="SVD\lm3s9gn5.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_384.FLM" start="0x00000000" size="0x00060000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9GN5&amp;fileType=pdf" title="LM3S9GN5 Datasheet"/>

          <feature type="PWM"           n="8"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="Other"         n="1"                           name="External Peripheral Interface"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="ComOther"      n="3"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="72"/>
        </device>
        
        <!-- *************************  Device 'LM3S9L71'  ***************************** -->
        <device Dname="LM3S9L71">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9l71.h" define="LM3S9L71"/>
          <debug svd="SVD\lm3s9l71.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9L71&amp;fileType=pdf" title="LM3S9L71 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="2"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="72"/>
        </device>
        
        <!-- *************************  Device 'LM3S9L97'  ***************************** -->
        <device Dname="LM3S9L97">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9l97.h" define="LM3S9L97"/>
          <debug svd="SVD\lm3s9l97.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9L97&amp;fileType=pdf" title="LM3S9L97 Datasheet"/>

          <feature type="PWM"           n="6"/>
          <feature type="TimerOther"    n="4"                           name="PWM Fault"/>
          <feature type="Other"         n="1"                           name="Dead-Band Generator"/>
          <feature type="Other"         n="2"                           name="Quadrature Encoder Interface (QEI)"/>
          <feature type="ComOther"      n="1"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="16"      m="10"/>
          <feature type="ComOther"      n="2"                           name="Precision Time Protocol (IEE1588)"/>
          <feature type="IOs"           n="60"/>
          <feature type="Other"         n="1"/>
        </device>
        
        <!-- *************************  Device 'LM3S9U81'  ***************************** -->
        <device Dname="LM3S9U81">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
          <compile header="Device\Include\lm3s9u81.h" define="LM3S9U81"/>
          <debug svd="SVD\lm3s9u81.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_384.FLM" start="0x00000000" size="0x00060000"             default="1"/>

          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S9U81&amp;fileType=pdf" title="LM3S9U81 Datasheet"/>

